{
  "en": {
    "nav": {
      "home": "Home",
      "games": "Games",
      "projects": "Projects",
      "contact": "Contact"
    },
    "header": {
      "name": "Alex Ceberio Hernandez",
      "subtitle": "RTIS programmer and Game Developer",
      "about": "About me",
      "about_text": "Hi, my name is Alex. I'm a C++ programmer with a focus on game programming, tools development, and AI development for games. I graduated from DigiPen Institute of Technology Bilbao with a Bachelor's degree in Computer Science in Real-Time Interactive Simulations (RTIS).<br><br>In this page, you can explore the projects and games I’ve worked on."
    },
    "games_info": {
      "juegos_estudiante": "Student games",
      "proyectos_estudiante" : "Student projects",
      "numbra":"A 3D puzzle and exploration game, where you travel a mysterious world and avoid being seen by the various enemies that will try to hunt you.",
      "crashNBurn":"Low poly space-themed racing game with highly customizable ships that provide you with different tools to hamper your rivals’ progress or gain a more direct advantage yourself.",
      "animaSilvarum":"A 2D action-exploration adventure set in a colorful world full of mysteries and enigmatic secrets.",
      "antSquad":"A top-down 2D reverse tower defence game where the player controls a nest of ants.",
      "ithangi":"A 2D top-down shooter where you control a tank that will fight against other enemy tanks.",
      "popThePops":"Race against your old enemy and bounce around to beat them on frenetic obstacle courses. Get the highest score to win!"
    },
    "details": {
      "fechaSalida": "Release date:",
      "tamañoEquipo": "Team Size:",
      "idioma": "Language:",
      "motor": "Engine:",
      "programadores": "programmers",
      "artistas": "artists",
      "descargar": "Download",
      "rol": "My role"
    },
    "meses":{
      "enero":"January",
      "febrero":"February",
      "marzo":"March",
      "abril":"April",
      "mayo":"May",
      "junio":"June",
      "julio":"July",
      "agosto":"August",
      "septiembre":"September",
      "octubre":"October",
      "noviembre":"Noverber",
      "diciembre":"December"
    },
    "animaSilvarum_data": {
      "motor": " 2D game engine done from scratch in C++",
      "description": "A 2D action-exploration adventure set in a colorful world full of mysteries and enigmatic secrets. Take control of Héctor, an apprentice scribe who is unexpectedly thrown into a criminal conspiracy involving robbery and a kidnapping. Investigate unexplored territories as you venture outside your village and into the uncharted realms beyond the forest. Defeat mysterious enemies, solve engaging puzzles, and recover what is yours by discovering the truth behind the crimes!",
      "rol": "I worked for this game at my second year at DigiPen, with the role of Gameplay programmer. The most relevant task I worked on where the following:",
      "rol1":"Implemented the collision and physics systems.",
      "rol2":"Created the level editor using ImGui and ImGuizmo, implementing the basics of object creation and deletion, component management, scene creation and loading, as well as many tools to help the artists better create levels, like ctrl z, vertex snapping or atlas loading.",
      "rol3":"Implemented text rendering and translation tools, including managing characters not present on the english language.",
      "rol4":"For gameplay, I worked on the quest system, final boss, and UI work like the menus and game UI."
    },
    "numbra_data":{
      "motor": "Unreal Engine 5",
      "description" : "A 3D puzzle and exploration game, inspired by the likes of Little Nightmares or Inside.", 
      "lore" :"In a desolate and ominous world, a young girl faces dark creatures that lurk in every shadow. With each step, the danger grows. But there is only one rule: stay awake.",
      "rol":"I worked for this game at my forth year at DigiPen, with the role of Gameplay programmer. My most relevant taks I worked on where all the enemies in the game, from which I used and learned a good variety of tools Unreal Engine provides, such as their AI system with behaviour trees, level sequences and state machies for the animations."
    },
    "crashNBurn_data":{
      "motor": "3D game engine done from scratch in C++",
      "description": "Low poly space-themed racing game with highly customizable ships that provide you with different tools to hamper your rivals’ progress or gain a more direct advantage yourself. You can play with up to 3 other frinds locally",
      "rol" :"I worked for this game at my third year at DigiPen, with the role of Gameplay programmer. The most relevant task I worked on where the following:",
      "rol1" :"Implemented the input event system for keyboard and mouse using SDL",
      "rol2" :"Created the editor using ImGui and ImGuizmo, implementing the basics of object creation and deletion, component management, scene creation and loading and more things.",
      "rol3_1" :"Develped the AIs of the game, for which I used the ",
      "rol3_2" : "algorithm entirely on my own."
    },
    "antSquad_data":{
      "motor": "2D engine provided by DigiPen",
      "description":"Ant Squad is a Top-down 2D reverse tower defence game where the player controls a nest of ants, and he has to send them throughout the map, so they reach to the end of the enemy base. The player will have three different type of units and will be able to send them through three different paths. At the end of the map there is the final boss and alongside the three paths there are enemies to delay the advance of the player.",
      "rol":"This was my second game I worked on my first year at DigiPen, with the role of Game Programmer, altough I also worked a lot on the design of the game. The most relevant task I worked on where the following:",
      "rol1":"Design of the game mechanics and balancing the game economy system.",
      "rol2":"Programmed the power ups of the player.",
      "rol3":"Made the UI of the player and enemy units, the power up and path selection buttons."
    },
    "ithangi_data":{
      "description":"The game is a 2D top-down shooter where you control a tank that will fight against other enemy tanks. There are 3 different levels, and the objective is unique to each one of them, as well as the terrains, which have unique mechanics. You can also play with a different tank depending on the level. The thematic of the game is based in battles of the second world war and their tanks.",
      "rol":"This was my first game I worked on at DigiPen, with the role of Game Designer. The most relevant task I worked on where the following:",
      "rol1":"Design of the game mechanics, enemy types and level design.",
      "rol2":"Programmed the player movement and main mechanics like shooting and power ups.",
      "rol3":"Made the UI of the player and menus."
    },
    "popThePops_data":{
      "description": "A 2-player local versus 2.5D platformer (3D models with 2D gameplay mechanics), where you race to the goal while inside a bubble. It was made for 2025's Global Game Jam, made in less than 3 days, with the topic being \"Bubbles\", and it won the prize for the best user experience."
    }
  },
  "es": {
    "nav": {
      "home": "Inicio",
      "games": "Juegos",
      "projects": "Proyectos",
      "contact": "Contacto"
    },
    "header": {
      "name": "Alex Ceberio Hernández",
      "subtitle": "Programador RTIS y Desarrollador de Juegos",
      "about": "Sobre mí",
      "about_text": "Hola, me llamo Alex. Soy programador C++ con un enfoque en programación de videojuegos, desarrollo de herramientas y desarrollo de IA para juegos. Me gradué en DigiPen Institute of Technology Bilbao con el Grado en Informática en Simulaciones Interactivas en Tiempo Real (RTIS).<br><br>En esta página, puedes explorar los proyectos y videojuegos en los que he trabajado."
    },
    "games_info": {
      "juegos_estudiante": "Juegos de estudiante",
      "proyectos_estudiante" : "Proyectos de estudiante",
      "numbra":"Un juego 3D de puzles y exploración, en el cual viajaras por un misterioso mundo evitando ser visto por los varios enemigos que tratarán de cazarte.",
      "crashNBurn":"Un juego de carreras low poly con temáticas del espacio, con naves customizables con habilidades únicas, con las cuales molestar a tus rivales o conseguir ventajas propias.",
      "animaSilvarum":"Un juego de acción y exploración 2D, en un mundo lleno de colores, misterios y secretos enigmáticos.",
      "antSquad":"Un tower defense inverso 2D en el cual controlas una colonia de hormigas.",
      "ithangi":"Un top-down shooter en 2D donde controlas un tanque y luchas contra otros tanques.",
      "popThePops":"Compite contra tu viejo rival, bota y rebota para superar obstaculos en frenéticas carreras. ¡Consigue la puntuación más alta para ganar!"
    },
    "details": {
      "fechaSalida": "Fecha de salida:",
      "tamañoEquipo": "Tamaño del equipo:",
      "idioma": "Idioma:",
      "motor": "Motor:",
      "programadores": "programadores",
      "artistas": "artistas",
      "descargar": "Descargar",
      "rol": "Mi rol"
    },
    "meses":{
      "enero":"de enero",
      "febrero":"de febrero",
      "marzo":"de marzo",
      "abril":"de abril",
      "mayo":"de mayo",
      "junio":"de junio",
      "julio":"de julio",
      "agosto":"de agosto",
      "septiembre":"de septiembre",
      "octubre":"de octubre",
      "noviembre":"de noviembre",
      "diciembre":"de diciembre"
    },
    "animaSilvarum_data": {
      "motor": "2D programado desde cero en C++",
      "description": "Una aventura de acción y exploración en 2D ambientada en un mundo colorido, lleno de misterios y secretos enigmáticos. Toma el control de Héctor, un aprendiz de escriba que es arrastrado inesperadamente a una conspiración criminal que involucra un robo y un secuestro. Investiga territorios inexplorados mientras te aventuras fuera de tu aldea y hacia los reinos desconocidos más allá del bosque. ¡Derrota a enemigos misteriosos, resuelve acertijos desafiantes y recupera lo que es tuyo descubriendo la verdad detrás de los crímenes!",
      "rol": "Trabajé en este juego durante mi segundo año en DigiPen, con el rol de programador de jugabilidad. Las tareas más relevantes en las que trabajé fueron las siguientes:",
      "rol1":"Implementé el sistema de colisiones y físicas.",
      "rol2":"Creé el editor de niveles usando ImGui e ImGuizmo, implementando las herramientas básicas de creación y destrucción de objetos,controlador de componentes, creación y cargado de escenas, asi como otras herramientas para ayudar a los artistas en la creacion de niveles, como el ctrl z, vertex snapping o cargar atlases.",
      "rol3":"Implementé herramientas de traducción y renderizado de texto, incluyendo la gestión de caracteres exclusivos no presentes en el inglés",
      "rol4":"Tema gameplay, trabajé en el sistema de misiones, IA del jefe final, y todo el UI del menu y gameplay."
    },    
    "numbra_data":{
      "motor": "Unreal Engine 5",
      "description" : "Un juego de exploración y puzzles en 3D, inspirado en juegos del estilo de Little Nightmares o Inside.", 
      "lore" :"En un mundo desolado y ominoso, una joven enfrenta a criaturas oscuras que acechan en cada sombra. Con cada paso, el peligro aumenta. Pero solo hay una regla: mantenerse despierta.",
       "rol":"Trabajé en este juego en mi cuarto año en DigiPen, con el rol de Gameplay Programmer. Mis tareas más relevantes fueron el desarrollo de todos los enemigos del juego, en lo cual utilicé y aprendí una buena variedad de herramientas que ofrece Unreal Engine, como su sistema de IA con Behaviour Trees, secuencias de nivel y máquinas de estados para las animaciones."
    },
    "crashNBurn_data":{
      "motor": "3D programado desde cero en C++",
      "description": "Un juego de carreras low poly con temáticas del espacio, con naves customizables con habilidades únicas, con las cuales molestar a tus rivales o conseguir ventajas propias. Puedes jugar con hasta 3 amigos de manera local.",
      "rol" :"Trabajé en este juego en mi tercer año en DigiPen como programador de Gameplay. Las tareas más relevantes en las que trabajé fueron las siguientes:",
      "rol1" :"Implementé el sistema de eventos de inputs para teclado y raton usando SDL.",
      "rol2" :"Creé el editor usando las librerías dee ImGui e ImGuizmo, implementando las herramientas básicas de creación y destrucción de objetos, controlador de componentes, creación y cargado de escenas y más cosas",
      "rol3_1" :"Creé las IAs del juego, para lo cual implementé el algoritmo de",
      "rol3_2" : " yo entero."
    },
    "antSquad_data":{
      "motor": "2D proporcionado por DigiPen",
      "description":"Ant Squad es un tower defense inverso top-down en 2D, donde el jugador controla un nido de hormigas y debe enviarlas a través del mapa para que lleguen hasta la base enemiga. El jugador tendrá tres tipos diferentes de unidades y podrá enviarlas por tres caminos distintos. Al final del mapa se encuentra el jefe final, y a lo largo de los tres caminos hay enemigos que intentarán retrasar el avance del jugador.",
      "rol":"Este fue mi segundo juego en el que trabajé durante mi primer año en DigiPen, con el rol de Game Programmer, aunque también participé mucho en el diseño del juego. Las tareas más relevantes en las que trabajé fueron las siguientes:",
      "rol1":"Diseñé las mecanicas del juego y balanceé el sistema de economia del juego.",
      "rol2":"Programé los power ups del jugador.",
      "rol3":"Creé el UI del jugador y unidades enemigas, asi como los botones de los menus y power ups."
    },
    "ithangi_data":{
      "description":"Ithangi es un top-down shooter en 2D donde tendrás que combatir contra tanques enemigos con tu propio tanque. Tiene 3 niveles jugables, y el objetivo en cada uno será diferente, asi como el los terrenos, que tendrán mecánicas diferentes. Además, en cada nivel usaras un tanque diferente. El juego,sus niveles y tanques estan basados en batallas de la segunda guerra mundial.",
      "rol":"Este fué el primer juego en el que trabaje en DigiPen, con el rol de Game Designer. Las tareas más relevantes en las que trabajé fueron las siguientes:",
      "rol1":"Diseñé las mecánicas del juegos, los tipos de enemigos y el diseño de niveles.",
      "rol2":"Programé el movimiento del tanque del jugador y las mecánicas principales, como el disparo y los power ups",
      "rol3":"Creé el UI del player y los menus."
    },
    "popThePops_data":{
      "description": "Un juego de plataformas 2.5D (modelos 3D con mecánicas de juego en 2D) para 2 jugadores en modo local, donde compites por llegar a la meta mientras estás dentro de una burbuja. Fue desarrollado para la Global Game Jam 2025 en menos de 3 días, con la temática \"Burbujas\", y ganó el premio a la mejor experiencia de usuario."
    }
  }
}